[
  {
    "companyName": "ethio telecom",
    "catagory": "telecom",
    "publishedOn": "ethio telecom website",
    "bidClosingDate": "February 13, 2024",
    "bidOpeningDate": " February 13, 2024",
    "BidAnnouncementNo": "4253201",
    "title": "National Competitive Bid For The Procurement Of MSAG & MSAN WIRE MESH FENCE WORK Site.",
    "description": {
      "des1": "Ethio telecom invites all interested and eligible bidders by this National Competitive Bid for the procurement of “MSAG & MSAN WIRE MESH FENCE WORK Site. Id 605, 476, 486, 640, 645, 2110 & 482” with RFQ No. 4253201 to sign a contract agreement with the finally awarded bidder(s).",
      "des2": "Bids received in time and fulfilling the other formalities shall be opened in the                   presence of interested bidders or their legal representatives on February 13, 2024            at 2:30pm Tadesse Chekole Building, Floor 9th Room No.910.",
      "des3": "Partial bid is not Allowed.",
      "des4": "Bidders are seriously advised to read and comply with the instructions provided in this bidding document.",
      "des5": "No one is allowed to duplicate or transfer the bidding document that she/he acquired to participate under this invitation. Legally authorized agents shall collect the bidding documents for each principal they are representing.",
      "des6": "Ethio telecom reserves the right to reject all or parts of this bid.",
      "des7": ""
    }
  },
  {
    "companyName": "ethio telecom",
    "catagory": "telecom",
    "publishedOn": "ethio telecom website",
    "bidClosingDate": "January 24, 2024.",
    "bidOpeningDate": "December 29, 2023",
    "BidAnnouncementNo": "4252965 ",
    "title": "Open National Competitive Bid (NCB) For The Procurement Of Flammable Torch Lighter Gun And Voltage Detector.",
    "description": {
      "des1": "The Bank that issues the bond as per 2 (b) here above shall unequivocally guarantee to pay the purchaser immediately upon the first written demand of payment. The Purchaser’s written demand of payment shall not be subject to any condition whatsoever.",
      "des2": "The bond issuing bank shall clearly incorporate the content stated under Clause here above on the issued bond.",
      "des3": "Sealed bids marked as: “Flammable Torch Lighter Gun and Voltage Detector with RFQ No 4252965 AND 4252974 and be addressed to:",
      "des4": "Ethio telecom, Head Quarter, Supply Chain Division,2nd Floor, Room No.211B, p. O. Box 1047, Addis Ababa, Ethiopia 3. Bid proposal will be received at the Churchill Road, Head Quarter 2nd Floor, Room   No.211B, before or on January,24 2024, until 5:00 P.M. Bids presented by any bidder after the closing date and time shall not be accepted. 4. Bids received in time and fulfilling the other formalities shall be opened in the presence of interested bidders or their legal representatives on January 25, 2024, at 10:00 A.M, at Churchill Road, Head Quarter 2nd Floor, Room No.210. 5. Bidders are seriously advised to read and comply with the instruction provided in this bidding document. 6. No one is allowed to duplicate or transfer the bidding document that she/he acquired to participate under this invitation. 7. Interested bidders are expected to register their companies in the below link while participating in Ethio telecom bids. https://www.ethiotelecom.et/supply-chain-home-page/ 8.Ethio Telecom reserves the right to reject all or parts of this bid. 9.  Partial bid is allowed.",
      "des5": "",
      "des6": "",
      "des7": ""
    }
  },
  {
    "companyName": "ethio telecom",
    "catagory": "telecom",
    "publishedOn": "ethio telecom website",
    "bidClosingDate": "December 18, 2024",
    "bidOpeningDate": "December 18, 2023",
    "BidAnnouncementNo": "4251881",
    "title": "National Competitive Bid (NCB) For The Procurement Of Fire Prevention System At Headquarter.",
    "description": {
      "des1": "RequirementS Ethio telecom invites all interested and eligible bidders by this National Competitive Bid (NCB) for the procurement of Fire Prevention System at Headquarter with RFQ No. 4251881. The Tender remains floating from December 18 to January 9, 2024. Bid documents can be obtained from web sites www.afrotender.com, www.extratenders.com and www.2merkato.com upon payment of a non-refundable fee of Birr 100.00 (Birr One hundred only) by using tele birr payment platform. In addition, If you are interested to be on the supplier list of ethio telecom please register using the following link or copy and paste the link on a browser “https://erp.ethiotelecom.et/OA_HTML/jsp/pos/suppreg/SupplierRegister.jsp?ouid=0EED8A04B857259C”. 1.Interested bidders are expected to fulfill the Requirements stated here below: a. Furnish bid security with ETB 50,000.00 (Fifty Thousand Birr) b. Availability of Letter of Authorization to sign the bid offers; c. Valid and renewed trade license for the year; d. VAT registration certificate. e. Valid tax clearance certificate f. Bid submission sheet g. Legal establishment of the company including joint venture (if any) 1.1 The Bid must be accompanied by a bid security in the amount of Birr 50,000.00 (Birr Fifty Thousand only) The bid bond shall be furnished in one of the following forms: – a. Certified Cheque /CPO issued by a recognized domestic bank or b. Bond issued by and/or confirmed through a recognized/reputable                    Domestic bank. 1.2 The Bank that issues the bond as per 3.1 (b) here above shall unequivocally guarantee to pay the purchaser immediately upon the first written demand of payment. The Purchaser’s written demand of payment shall not be subject to any condition what so ever. 1.3 The bond issuing bank shall clearly incorporate the content stated under Clause here above on the issued bond. 1.4 Sealed bids marked as “Tender for the procurement of Fire Prevention System at Headquarter with RFQ No. 4251881. and be addressed to:",
      "des2": "Ethio telecom,",
      "des3": "Head Quarter",
      "des4": "Churchill Road",
      "des5": "Supply Chain Division",
      "des6": "2nd Floor, Room No.211B,",
      "des7": "P. O. Box 1047, Addis Ababa, Ethiopia."
    }
  },
  {
    "companyName": "ethio ariline",
    "catagory": "aviation",
    "publishedOn": "ethio airline website",
    "bidClosingDate": "December 02, 2024",
    "bidOpeningDate": "December 18, 2023",
    "BidAnnouncementNo": "SSNT-T429 ",
    "title": "Invitation to tender for the supply of Flowers to different Locations(SSNT-T429)",
    "description": {
      "des1": "Ethiopian Airlines Group intends to select potential Flower Providers for its different Events and Office Decors for the coming two years on a contractual basis. Any interested company with the following minimum requirements are eligible to participate on the tender.",
      "des2": "Bidder having a valid and renewed Trade license, with a minimum flower providing experience of 5 years and above, valid service provider certificate, VAT & Tax Registration Certificate, Tax clearance certificate.",
      "des3": "Bidders must submit 10,000.00 Birr/Ten Thousand birr/ as a bid security in the form of CPO or bid bond from any certified financial institution. ",
      "des4": "Bidders should deposit non-refundable ETB 100.00 (One Hundred Birr) to the nearby Commercial Bank of Ethiopia (CBE) branch referring this tender number SSNT-T429 to Ethiopian Airlines Account Number 1000006958277(E-99). Bidders shall email the scan copy of the deposit slip to the below address and will get the Tender document by return Email.",
      "des5": "Bids must be submitted in separate envelopes i.e., the (Technical Proposal, Financial Offer, and Bid Security) and one outer envelope, duly marking the inner envelopes as “ORIGINAL” and “COPIES” document delivered to Ethiopian Airlines Group, Strategic Sourcing Non-Technical section before/on January 1,2024 at 11:00AM in the morning. The bid will be opened on the same date at 3:30PM at Ethiopian Airlines Group head office, in the bidding room around the Flight Operation Building in the presence of those interested bidders or their representatives.",
      "des6": "For more information; please contact the below address.",
      "des7": "Tel. 011-5-178025"
    }
  },
  {
    "companyName": "ethio ariline",
    "catagory": "aviation",
    "publishedOn": "ethio airline website",
    "bidClosingDate": "December 22, 2024",
    "bidOpeningDate": "January 18, 2023",
    "BidAnnouncementNo": "SSNT-T428",
    "title": "Invitation to Bid: Design-Build of Ethiopian Airlines Aviation University Landscaping, Greenery Development & Associated Works.",
    "description": {
      "des1": "The Ethiopian Airlines Group intends to invite qualified bidders of Category GC2/BC2 and above contractors, for the Construction of Design-Build of Ethiopian Airlines Aviation University Landscaping, Greenery Development & Associated Works.",
      "des2": "Any construction company legally established with relevant trade license valid for the current year, VAT registration certificate, Taxpayer Identification Number (TIN), Registration on Tax clearance certificate stating the bidder eligibility to participate in any public tender and valid at least at the deadline for submission of bids can get the tender document.",
      "des3": "Bidders should deposit non-refundable ETB 100.00 (One hundred birr only) to the nearby Commercial Bank of Ethiopia (CBE) branch referring the tender number SSNT-T428 to Ethiopian Airlines Account Number 1000006958277 (E-99) and shall email the scanned copy of the deposit slip to the below email address and will get the Tender document by return Email.",
      "des4": "Bidders shall furnish bid security in the form of CPO or unconditional and irrevocable bank guarantee with an amount of Birr 100,000.00 (One Hundred Thousand Birr) in the name of Ethiopian Airlines Group. The deposit bid Security received from unsuccessful bidders will be returned.",
      "des5": "Bidders are required to bring sealed Original and Copy of their Technical and Financial Proposal on or before January11,2024, at 03:00 PM The bid will be opened on the same date at 03:15 PM at Ethiopian Airlines Compound in the presence of bidders or their representatives.",
      "des6": "For more information, please contact the below address.",
      "des7": "Tel: 0115-17-42-58   Attention Selamawit Abate"
    }
  },
  {
    "companyName": "ethio ariline",
    "catagory": "aviation",
    "publishedOn": "ethio airline website",
    "bidClosingDate": "December 22, 2024",
    "bidOpeningDate": "January 18, 2023",
    "BidAnnouncementNo": "SSNT-T 422",
    "title": "Invitation to Tender for the selection of Category (GC-4 /BC-4) and above SC-WM-1 Construction Companies for the construction of Baggage Sorting Area Super-Structure at Bole International Airport, inside MRO Compound.",
    "description": {
      "des1": "Ethiopian Airlines Group intends to conduct a bid for the selection of potential Category (GC-4 /BC-4) and above SC-WM-1 Construction Companies for the construction of Baggage Sorting Area Super-Structure at Bole International Airport, inside MRO Compound.  ",
      "des2": "Legally established bidders in Ethiopia able to provide renewed Trade License for the current year, Valid Tax clearance, Valid license to participate on government bids, VAT registration certificate and Tax Payer Identification Certificate (TIN) can get the tender document.",
      "des3": "Bidders should deposit non-refundable ETB 100.00 (One Hundred Birr) to the nearby Commercial Bank of Ethiopia (CBE) referring this tender number SSNT-T 422 to Ethiopian Airlines Group Account Number 1000006958277(E-99). Bidders shall email the scanned copy of the deposit slip to the below address and will get the Tender document by return Email.",
      "des4": "Bidders must submit Birr 150,000.00 / One hundred fifty thousand Birr / as a bid security in the form of CPO or unconditional irrevocable bank guarantee from any certified financial institution in the name of Ethiopian Airlines Group.   ",
      "des5": "Bidders are required to bring both Original and Copy of their Technical and Financial Bid Proposal in separate sealed envelope. The bid will be closed on December 15, 2023 at 2:30 PM and will be opened the same date at 3:00 PM at Ethiopian Airlines Group Employees Main Cafeteria in the presence of bidders or their representatives.  ",
      "des6": "For more information; please contact us with the below address.",
      "des7": "Tel. 011-517-8025"
    }
  }
]
